dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32f417_pinmux.h
	((gpio == PG10) && (func == FSMC_NE3_FUNC            )) ? 12 : \
	((gpio == PG11) && (func == ETH_TX_EN_FUNC           )) ? 11 : \
	((gpio == PG11) && (func == FSMC_NCE4_2_FUNC         )) ? 12 : \
	((gpio == PG12) && (func == USART6_RTS_FUNC          )) ?  8 : \
	((gpio == PG12) && (func == FSMC_NE4_FUNC            )) ? 12 : \
	((gpio == PG13) && (func == USART6_CTS_FUNC          )) ?  8 : \
	((gpio == PG13) && (func == ETH_TXD0_FUNC            )) ? 11 : \
	((gpio == PG13) && (func == FSMC_A24_FUNC            )) ? 12 : \
	((gpio == PG14) && (func == USART6_TX_FUNC           )) ?  8 : \
	((gpio == PG14) && (func == ETH_TXD1_FUNC            )) ? 11 : \
	((gpio == PG14) && (func == FSMC_A25_FUNC            )) ? 12 : \
	((gpio == PG15) && (func == USART6_CTS_FUNC          )) ?  8 : \
	((gpio == PG15) && (func == DCMI_D13_FUNC            )) ? 13 : \
	((gpio == PH00) && (func == RCC_OSC_IN_FUNC          )) ?  0 : \
	((gpio == PH01) && (func == RCC_OSC_OUT_FUNC         )) ?  0 : \
	((gpio == PH02) && (func == ETH_CRS_FUNC             )) ? 11 : \
	((gpio == PH03) && (func == ETH_COL_FUNC             )) ? 11 : \
	((gpio == PH04) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PH04) && (func == USB_OTG_HS_ULPI_NXT_FUNC )) ? 10 : \
	((gpio == PH05) && (func == I2C2_SDA_FUNC            )) ?  4 : \
	((gpio == PH06) && (func == I2C2_SMBA_FUNC           )) ?  4 : \
	((gpio == PH06) && (func == TIM12_CH1_FUNC           )) ?  9 : \
	((gpio == PH06) && (func == ETH_RXD2_FUNC            )) ? 11 : \
	((gpio == PH07) && (func == I2C3_SCL_FUNC            )) ?  4 : \
	((gpio == PH07) && (func == ETH_RXD3_FUNC            )) ? 11 : \
	((gpio == PH08) && (func == I2C3_SDA_FUNC            )) ?  4 : \
	((gpio == PH08) && (func == DCMI_HSYNC_FUNC          )) ? 13 : \
	((gpio == PH09) && (func == I2C3_SMBA_FUNC           )) ?  4 : \
	((gpio == PH09) && (func == TIM12_CH2_FUNC           )) ?  9 : \
	((gpio == PH09) && (func == DCMI_D0_FUNC             )) ? 13 : \
	((gpio == PH10) && (func == TIM5_CH1_FUNC            )) ?  2 : \
	((gpio == PH10) && (func == DCMI_D1_FUNC             )) ? 13 : \
	((gpio == PH11) && (func == TIM5_CH2_FUNC            )) ?  2 : \
	((gpio == PH11) && (func == DCMI_D2_FUNC             )) ? 13 : \
	((gpio == PH12) && (func == TIM5_CH3_FUNC            )) ?  2 : \
	((gpio == PH12) && (func == DCMI_D3_FUNC             )) ? 13 : \
	((gpio == PH13) && (func == TIM8_CH1N_FUNC           )) ?  3 : \
	((gpio == PH13) && (func == CAN1_TX_FUNC             )) ?  9 : \
	((gpio == PH14) && (func == TIM8_CH2N_FUNC           )) ?  3 : \
	((gpio == PH14) && (func == DCMI_D4_FUNC             )) ? 13 : \
	((gpio == PH15) && (func == TIM8_CH3N_FUNC           )) ?  3 : \
	((gpio == PH15) && (func == DCMI_D11_FUNC            )) ? 13 : \
	((gpio == PI00) && (func == TIM5_CH4_FUNC            )) ?  2 : \
	((gpio == PI00) && (func == I2S2_WS_FUNC             )) ?  5 : \
	((gpio == PI00) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PI00) && (func == DCMI_D13_FUNC            )) ? 13 : \
	((gpio == PI01) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PI01) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PI01) && (func == DCMI_D8_FUNC             )) ? 13 : \
	((gpio == PI02) && (func == TIM8_CH4_FUNC            )) ?  3 : \
	((gpio == PI02) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PI02) && (func == I2S2_ext_SD_FUNC         )) ?  6 : \
	((gpio == PI02) && (func == DCMI_D9_FUNC             )) ? 13 : \
	((gpio == PI03) && (func == TIM8_ETR_FUNC            )) ?  3 : \
	((gpio == PI03) && (func == I2S2_SD_FUNC             )) ?  5 : \
	((gpio == PI03) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PI03) && (func == DCMI_D10_FUNC            )) ? 13 : \
	((gpio == PI04) && (func == TIM8_BKIN_FUNC           )) ?  3 : \
	((gpio == PI04) && (func == DCMI_D5_FUNC             )) ? 13 : \
	((gpio == PI05) && (func == TIM8_CH1_FUNC            )) ?  3 : \
	((gpio == PI05) && (func == DCMI_VSYNC_FUNC          )) ? 13 : \
	((gpio == PI06) && (func == TIM8_CH2_FUNC            )) ?  3 : \
	((gpio == PI06) && (func == DCMI_D6_FUNC             )) ? 13 : \
	((gpio == PI07) && (func == TIM8_CH3_FUNC            )) ?  3 : \
	((gpio == PI07) && (func == DCMI_D7_FUNC             )) ? 13 : \
	((gpio == PI08) && (func == RTC_AF2_FUNC             )) ?  0 : \
	((gpio == PI09) && (func == CAN1_RX_FUNC             )) ?  9 : \
	((gpio == PI10) && (func == ETH_RX_ER_FUNC           )) ? 11 : \
	((gpio == PI11) && (func == USB_OTG_HS_ULPI_DIR_FUNC )) ? 10 : \
	AF_NO_SUCH_PINFUNC)

# define TIMERMUX(gpio, timer_nr, channel_nr) ((gpio == PIN_NONE) ? AF_PIN_NONE : 	\
	((gpio == PA00) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA00) && (timer_nr ==  5) && (channel_nr ==  1)) ?  2 : \
	((gpio == PA01) && (timer_nr ==  2) && (channel_nr ==  2)) ?  1 : \
	((gpio == PA01) && (timer_nr ==  5) && (channel_nr ==  2)) ?  2 : \
	((gpio == PA02) && (timer_nr ==  2) && (channel_nr ==  3)) ?  1 : \
	((gpio == PA02) && (timer_nr ==  5) && (channel_nr ==  3)) ?  2 : \
	((gpio == PA02) && (timer_nr ==  9) && (channel_nr ==  1)) ?  3 : \
	((gpio == PA03) && (timer_nr ==  2) && (channel_nr ==  4)) ?  1 : \
	((gpio == PA03) && (timer_nr ==  5) && (channel_nr ==  4)) ?  2 : \
	((gpio == PA03) && (timer_nr ==  9) && (channel_nr ==  2)) ?  3 : \
	((gpio == PA05) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA05) && (timer_nr ==  8) && (channel_nr == -1)) ?  3 : \
	((gpio == PA06) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PA06) && (timer_nr == 13) && (channel_nr ==  1)) ?  9 : \
	((gpio == PA07) && (timer_nr ==  1) && (channel_nr == -1)) ?  1 : \
	((gpio == PA07) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PA07) && (timer_nr ==  8) && (channel_nr == -1)) ?  3 : \
	((gpio == PA07) && (timer_nr == 14) && (channel_nr ==  1)) ?  9 : \
	((gpio == PA08) && (timer_nr ==  1) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA09) && (timer_nr ==  1) && (channel_nr ==  2)) ?  1 : \
	((gpio == PA10) && (timer_nr ==  1) && (channel_nr ==  3)) ?  1 : \
	((gpio == PA11) && (timer_nr ==  1) && (channel_nr ==  4)) ?  1 : \
	((gpio == PA15) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PB00) && (timer_nr ==  1) && (channel_nr == -2)) ?  1 : \
	((gpio == PB00) && (timer_nr ==  3) && (channel_nr ==  3)) ?  2 : \
	((gpio == PB00) && (timer_nr ==  8) && (channel_nr == -2)) ?  3 : \
	((gpio == PB01) && (timer_nr ==  1) && (channel_nr == -3)) ?  1 : \
	((gpio == PB01) && (timer_nr ==  3) && (channel_nr ==  4)) ?  2 : \
	((gpio == PB01) && (timer_nr ==  8) && (channel_nr == -3)) ?  3 : \
	((gpio == PB03) && (timer_nr ==  2) && (channel_nr ==  2)) ?  1 : \
	((gpio == PB04) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PB05) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PB06) && (timer_nr ==  4) && (channel_nr ==  1)) ?  2 : \
	((gpio == PB07) && (timer_nr ==  4) && (channel_nr ==  2)) ?  2 : \
	((gpio == PB08) && (timer_nr ==  4) && (channel_nr ==  3)) ?  2 : \
	((gpio == PB08) && (timer_nr == 10) && (channel_nr ==  1)) ?  3 : \
	((gpio == PB09) && (timer_nr ==  4) && (channel_nr ==  4)) ?  2 : \
	((gpio == PB09) && (timer_nr == 11) && (channel_nr ==  1)) ?  3 : \
	((gpio == PB10) && (timer_nr ==  2) && (channel_nr ==  3)) ?  1 : \
	((gpio == PB11) && (timer_nr ==  2) && (channel_nr ==  4)) ?  1 : \
	((gpio == PB13) && (timer_nr ==  1) && (channel_nr == -1)) ?  1 : \
	((gpio == PB14) && (timer_nr ==  1) && (channel_nr == -2)) ?  1 : \
	((gpio == PB14) && (timer_nr ==  8) && (channel_nr == -2)) ?  3 : \
	((gpio == PB14) && (timer_nr == 12) && (channel_nr ==  1)) ?  9 : \
	((gpio == PB15) && (timer_nr ==  1) && (channel_nr == -3)) ?  1 : \
	((gpio == PB15) && (timer_nr ==  8) && (channel_nr == -3)) ?  3 : \
	((gpio == PB15) && (timer_nr == 12) && (channel_nr ==  2)) ?  9 : \
	((gpio == PC06) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PC06) && (timer_nr ==  8) && (channel_nr ==  1)) ?  3 : \
	((gpio == PC07) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PC07) && (timer_nr ==  8) && (channel_nr ==  2)) ?  3 : \
	((gpio == PC08) && (timer_nr ==  3) && (channel_nr ==  3)) ?  2 : \
	((gpio == PC08) && (timer_nr ==  8) && (channel_nr ==  3)) ?  3 : \
	((gpio == PC09) && (timer_nr ==  3) && (channel_nr ==  4)) ?  2 : \
	((gpio == PC09) && (timer_nr ==  8) && (channel_nr ==  4)) ?  3 : \
	((gpio == PD12) && (timer_nr ==  4) && (channel_nr ==  1)) ?  2 : \
	((gpio == PD13) && (timer_nr ==  4) && (channel_nr ==  2)) ?  2 : \
	((gpio == PD14) && (timer_nr ==  4) && (channel_nr ==  3)) ?  2 : \
	((gpio == PD15) && (timer_nr ==  4) && (channel_nr ==  4)) ?  2 : \
	((gpio == PE05) && (timer_nr ==  9) && (channel_nr ==  1)) ?  3 : \
	((gpio == PE06) && (timer_nr ==  9) && (channel_nr ==  2)) ?  3 : \
	((gpio == PE08) && (timer_nr ==  1) && (channel_nr == -1)) ?  1 : \
	((gpio == PE09) && (timer_nr ==  1) && (channel_nr ==  1)) ?  1 : \
	((gpio == PE10) && (timer_nr ==  1) && (channel_nr == -2)) ?  1 : \
	((gpio == PE11) && (timer_nr ==  1) && (channel_nr ==  2)) ?  1 : \
	((gpio == PE12) && (timer_nr ==  1) && (channel_nr == -3)) ?  1 : \
	((gpio == PE13) && (timer_nr ==  1) && (channel_nr ==  3)) ?  1 : \
	((gpio == PE14) && (timer_nr ==  1) && (channel_nr ==  4)) ?  1 : \
	((gpio == PF06) && (timer_nr == 10) && (channel_nr ==  1)) ?  3 : \
	((gpio == PF07) && (timer_nr == 11) && (channel_nr ==  1)) ?  3 : \
	((gpio == PF08) && (timer_nr == 13) && (channel_nr ==  1)) ?  9 : \
	((gpio == PF09) && (timer_nr == 14) && (channel_nr ==  1)) ?  9 : \
	((gpio == PH06) && (timer_nr == 12) && (channel_nr ==  1)) ?  9 : \
	((gpio == PH09) && (timer_nr == 12) && (channel_nr ==  2)) ?  9 : \
	((gpio == PH10) && (timer_nr ==  5) && (channel_nr ==  1)) ?  2 : \
	((gpio == PH11) && (timer_nr ==  5) && (channel_nr ==  2)) ?  2 : \
	((gpio == PH12) && (timer_nr ==  5) && (channel_nr ==  3)) ?  2 : \
	((gpio == PH13) && (timer_nr ==  8) && (channel_nr == -1)) ?  3 : \
	((gpio == PH14) && (timer_nr ==  8) && (channel_nr == -2)) ?  3 : \
	((gpio == PH15) && (timer_nr ==  8) && (channel_nr == -3)) ?  3 : \
	((gpio == PI00) && (timer_nr ==  5) && (channel_nr ==  4)) ?  2 : \
	((gpio == PI02) && (timer_nr ==  8) && (channel_nr ==  4)) ?  3 : \
	((gpio == PI05) && (timer_nr ==  8) && (channel_nr ==  1)) ?  3 : \
	((gpio == PI06) && (timer_nr ==  8) && (channel_nr ==  2)) ?  3 : \
	((gpio == PI07) && (timer_nr ==  8) && (channel_nr ==  3)) ?  3 : \
	AF_NO_SUCH_PINFUNC)
#endif
